NookCraftLab/ch585-qmk-vial/firmware/ch585_v2/user/usb/ch585_usbfs_device.c
/*
 * CH585 全速USB设备驱动（USB1，左边type C）
 * 标准键盘+鼠标复合HID设备
 * 基于官方HID_CompliantDev示例，描述符参考高速口CompositeKM
 */

#include "CH58x_common.h"
#include "ch585_usbfs_device.h"

#define DevEP0SIZE    0x40
#define DevEP1SIZE    0x08
#define DevEP2SIZE    0x08

// 设备描述符
const uint8_t FS_MyDevDescr[] = {
    0x12,                                                   // bLength
    0x01,                                                   // bDescriptorType
    0x00, 0x02,                                             // bcdUSB
    0x00,                                                   // bDeviceClass
    0x00,                                                   // bDeviceSubClass
    0x00,                                                   // bDeviceProtocol
    DevEP0SIZE,                                             // bMaxPacketSize0
    0x3d, 0x41,                                             // idVendor
    0x07, 0x21,                                             // idProduct
    0x00, 0x01,                                             // bcdDevice
    0x01,                                                   // iManufacturer
    0x02,                                                   // iProduct
    0x03,                                                   // iSerialNumber
    0x01,                                                   // bNumConfigurations
};

// 配置描述符（键盘+鼠标+Raw HID复合设备）
const uint8_t FS_MyCfgDescr[] = {
    /* Configuration Descriptor */
    0x09,                                                   // bLength
    0x02,                                                   // bDescriptorType
    0x5B, 0x00,                                             // wTotalLength (91 bytes)
    0x03,                                                   // bNumInterfaces
    0x01,                                                   // bConfigurationValue
    0x00,                                                   // iConfiguration
    0xA0,                                                   // bmAttributes: Bus Powered; Remote Wakeup
    0x32,                                                   // MaxPower: 100mA

    /* Interface Descriptor (Keyboard) */
    0x09,                                                   // bLength
    0x04,                                                   // bDescriptorType
    0x00,                                                   // bInterfaceNumber
    0x00,                                                   // bAlternateSetting
    0x01,                                                   // bNumEndpoints
    0x03,                                                   // bInterfaceClass
    0x01,                                                   // bInterfaceSubClass
    0x01,                                                   // bInterfaceProtocol: Keyboard
    0x00,                                                   // iInterface

    /* HID Descriptor (Keyboard) */
    0x09,                                                   // bLength
    0x21,                                                   // bDescriptorType
    0x11, 0x01,                                             // bcdHID
    0x00,                                                   // bCountryCode
    0x01,                                                   // bNumDescriptors
    0x22,                                                   // bDescriptorType
    0x3E, 0x00,                                             // wDescriptorLength

    /* Endpoint Descriptor (Keyboard) */
    0x07,                                                   // bLength
    0x05,                                                   // bDescriptorType
    0x81,                                                   // bEndpointAddress: IN Endpoint 1
    0x03,                                                   // bmAttributes
    DevEP1SIZE, 0x00,                                       // wMaxPacketSize
    0x0A,                                                   // bInterval: 10mS

    /* Interface Descriptor (Mouse) */
    0x09,                                                   // bLength
    0x04,                                                   // bDescriptorType
    0x01,                                                   // bInterfaceNumber
    0x00,                                                   // bAlternateSetting
    0x01,                                                   // bNumEndpoints
    0x03,                                                   // bInterfaceClass
    0x01,                                                   // bInterfaceSubClass
    0x02,                                                   // bInterfaceProtocol: Mouse
    0x00,                                                   // iInterface

    /* HID Descriptor (Mouse) */
    0x09,                                                   // bLength
    0x21,                                                   // bDescriptorType
    0x10, 0x01,                                             // bcdHID
    0x00,                                                   // bCountryCode
    0x01,                                                   // bNumDescriptors
    0x22,                                                   // bDescriptorType
    0x34, 0x00,                                             // wDescriptorLength

    /* Endpoint Descriptor (Mouse) */
    0x07,                                                   // bLength
    0x05,                                                   // bDescriptorType
    0x82,                                                   // bEndpointAddress: IN Endpoint 2
    0x03,                                                   // bmAttributes
    DevEP2SIZE, 0x00,                                       // wMaxPacketSize
    0x01,                                                   // bInterval: 1mS

    /* Interface Descriptor (Raw HID) */
    0x09,                                                   // bLength
    0x04,                                                   // bDescriptorType
    0x02,                                                   // bInterfaceNumber
    0x00,                                                   // bAlternateSetting
    0x02,                                                   // bNumEndpoints
    0x03,                                                   // bInterfaceClass: HID
    0x00,                                                   // bInterfaceSubClass
    0x00,                                                   // bInterfaceProtocol
    0x00,                                                   // iInterface

    /* HID Descriptor (Raw HID) */
    0x09,                                                   // bLength
    0x21,                                                   // bDescriptorType
    0x11, 0x01,                                             // bcdHID
    0x00,                                                   // bCountryCode
    0x01,                                                   // bNumDescriptors
    0x22,                                                   // bDescriptorType
    0x19, 0x00,                                             // wDescriptorLength (25 bytes)

    /* Endpoint Descriptor (Raw HID IN) */
    0x07,                                                   // bLength
    0x05,                                                   // bDescriptorType
    0x83,                                                   // bEndpointAddress: IN Endpoint 3
    0x03,                                                   // bmAttributes: Interrupt
    0x40, 0x00,                                             // wMaxPacketSize: 64 bytes
    0x01,                                                   // bInterval: 1mS

    /* Endpoint Descriptor (Raw HID OUT) */
    0x07,                                                   // bLength
    0x05,                                                   // bDescriptorType
    0x03,                                                   // bEndpointAddress: OUT Endpoint 3
    0x03,                                                   // bmAttributes: Interrupt
    0x40, 0x00,                                             // wMaxPacketSize: 64 bytes
    0x01                                                    // bInterval: 1mS
};

